#+title: ObjC (00): ObjC Runtime Inspector
#+date: 2025-12-09
#+layout: post
#+math: true
#+options: _:nil ^:nil
#+categories: lisp objc
* ObjC Runtime with JUST C API
#+begin_quote
The Objective-C runtime is a runtime library that provides support for
the dynamic properties of the Objective-C language, and as such is
linked to by all Objective-C apps. Objective-C runtime library support
functions are implemented in the shared library found at
/usr/lib/libobjc.A.dylib.
#+end_quote

(ref: [[https://developer.apple.com/documentation/objectivec/objective-c-runtime?language=objc][Objective-C Runtime]])

ObjC Runtime 可以被看作是一个纯 C 的 API, 尽管历史上有一些尝试 Cross-compile ObjC
到 C 的操作 (比如 [[https://web.archive.org/web/20190110121255/http://users.telenet.be/stes/compiler.html][Protable Object Compiler]]), 或者是使用 clang 的 [[https://clang.llvm.org/docs/ClangCommandLineReference.html#cmdoption-clang-rewrite-objc][=-rewrite-objc=]].
但是实际上貌似也没有很好用...

#+html: <details><summary>关于 -rewrite-objc</summary>

假如有这样的 =test.m= 代码文件

#+begin_src objc
#import <Foundation/Foundation.h>

// --- Main Entry Function ---
int main(int argc, const char * argv[]) {
    @autoreleasepool {
      NSLog(@"Hello World");
    }
    return 0;
}
#+end_src

可以如下实现 "rewrite" 的操作:

#+begin_src shell
clang -rewrite-objc test.m -o test.cpp
#+end_src

但是实际上得到的结果几乎是不可读的. 不过有一个小 trick:
你可以通过构建一个空代码文档:

#+begin_src objc
#import <Foundation/Foundation.h>
#+end_src

然后用 =diff= 的方式来判断相比空文件,
新的代码在 rewrite 的时候有什么不同.

#+begin_src shell :dir ~/Buff/ :results verbatim :exports both
diff empty.cpp test.cpp
#+end_src

#+RESULTS:
#+begin_example
108a109
> static __NSConstantStringImpl __NSConstantStringImpl__var_folders_j2_gn8hljx139d7671xs5x0xw400000gn_T_test_4a1764_mi_0 __attribute__ ((section ("__DATA, __cfstring"))) = {__CFConstantStringClassReference,0x000007c8,"Hello World",11};
63348c63349,63354
<
---
> int main(int argc, const char * argv[]) {
>     /* @autoreleasepool */ { __AtAutoreleasePool __autoreleasepool;
>       NSLog((NSString *)&__NSConstantStringImpl__var_folders_j2_gn8hljx139d7671xs5x0xw400000gn_T_test_4a1764_mi_0);
>     }
>     return 0;
> }
#+end_example

#+html: </details>

欸, 但是现在不是有 LLM AI 么? 大可以让 AI 来帮我们重写.

#+begin_example
Rewrite the following Objective-C code using ObjC runtime with only valid C code.
Return code only with out explanation. The code logic should be same as original,
with minimal comments.

{{your code here}}
#+end_example

#+html: <details><summary>一个例子</summary>

#+begin_src c
#include <objc/objc.h>
#include <objc/runtime.h>
#include <objc/message.h>
#include <stdio.h>

// Function pointer typedef for better readability and casting
typedef id (*NSObjectInitMethod)(id, SEL);
typedef void (*NSLogMethod)(id, SEL, NSString*);

int main(int argc, const char * argv[]) {
    // Manually setting up the Autorelease Pool equivalent (less strict than @autoreleasepool)
    // In pure C/runtime context, setting up a pool requires calling NSObject/NSAutoreleasePool methods.
    // However, for a simple `NSLog` call, we often rely on the runtime environment
    // or manually interact with NSAutoreleasePool. Since NSAutoreleasePool is deprecated
    // and modern ObjC uses scope-based pools, we'll try to simulate the minimum environment
    // to allow ObjC calls to work, which often means initializing an autorelease pool
    // and draining it.

    Class NSAutoreleasePoolClass = objc_getClass("NSAutoreleasePool");
    SEL initSel = sel_registerName("init");
    SEL newSel = sel_registerName("new");
    SEL drainSel = sel_registerName("drain");
    SEL NSLogSel = sel_registerName("NSLog");

    // Create an autorelease pool instance: [NSAutoreleasePool new];
    id pool = ((id (*)(Class, SEL))objc_msgSend)(NSAutoreleasePoolClass, newSel);

    // Call NSLog: NSLog(@"Hello World");
    // We need to get the NSString * object for @"Hello World"
    // Since we can't use the Objective-C literal @"...", we must rely on
    // an external mechanism or the runtime's internal string creation.
    // For simplicity in a self-contained C file, we often assume the constant
    // string exists or use a bridging function. A common way for known strings
    // is to use C-string bridges, but the most correct runtime way is to find
    // the static string object defined by the compiler.
    // Given the constraints of "pure C code", we cannot easily create
    // an NSString* object that the C code doesn't define.
    // If we assume the ObjC runtime is initialized and handles string literals
    // in the same manner as a compiled ObjC file (which is a stretch for pure C),
    // we would use a predefined external pointer.

    // As a simplification, we must usually cheat and use an external symbol
    // or use a helper function to get an NSString.
    // The closest to a pure C solution while still being valid ObjC runtime is
    // to use the external symbol `__CFStringMakeConstantString` or `objc_auto.c`'s
    // string mechanism.

    // ******* Using a common workaround to get a static NSString *******
    // This function is usually what the compiler calls for @"..."
    extern id __CFStringMakeConstantString(const char *);

    // Create the NSString* object for "Hello World"
    id helloWorldString = __CFStringMakeConstantString("Hello World");

    // Call NSLog((id)nil, NSLogSel, helloWorldString);
    // NSLog is a variadic function and is usually called as a C function or via
    // a special objc_msgSend variant. The standard `NSLog` signature is:
    // void NSLog(NSString *format, ...);
    // When called via message passing, it looks like:
    // ((void (*)(id, SEL, id))objc_msgSend)(nil, NSLogSel, helloWorldString);

    // Use objc_msgSend for the call. NSLog's "receiver" is typically `nil` or treated as a C function.
    // It's safer to call it as a C function if the environment is set up.
    // For strict `objc_msgSend` use:
    ((void (*)(id, SEL, id))objc_msgSend)((id)nil, NSLogSel, helloWorldString);


    // Drain the pool: [pool drain];
    ((void (*)(id, SEL))objc_msgSend)(pool, drainSel);

    return 0;
}
#+end_src

#+html: </details>

基本上还算是可以使用的, 所以用这样的方法可以快速得到如何在 C 里面去使用 ObjC Runtime 的例子了.

